/* 
   Localizable.strings
   Proxly

   Created for localization support.
*/

// MARK: - Defaults
"defaults.new_rule_name" = "Nowa reguła";

// MARK: - Tab Navigation
"tab.rules" = "Reguły";
"tab.settings" = "Ustawienia";
"tab.about" = "O programie";

// MARK: - General UI
"window.title.settings" = "Ustawienia Proxly";
"button.add_rule" = "Dodaj regułę";
"button.save" = "Zapisz";
"button.cancel" = "Poniechaj";
"button.delete" = "Usuń";
"button.ok" = "OK";
"button.open_system_preferences" = "Otwórz Ustawienia Systemowe";

// MARK: - Settings View
"settings.title" = "Ustawienia";
"settings.section.general" = "Ogólne";
"settings.section.default_behavior" = "Domyślne zachowanie";
"settings.section.logging" = "Dziennikowanie";

"settings.enable_rules.title" = "Włącz reguły";
"settings.enable_rules.subtitle.enabled" = "Reguły są aktywne";
"settings.enable_rules.subtitle.disabled" = "⚠️ Wszystkie reguły będą ignorowane!";

"settings.launch_at_login.title" = "Uruchamiaj przy logowaniu";
"settings.launch_at_login.subtitle" = "Automatycznie uruchamiaj Proxly po zalogowaniu się na Maca";

"settings.when_no_rule_matches" = "Gdy żadna reguła nie pasuje:";
"settings.default_behavior.show_selection" = "Pokaż wybór przeglądarki";
"settings.default_behavior.open_fallback" = "Otwórz w domyślnej przeglądarce";

"settings.fallback_browser.title" = "Domyślna przeglądarka";
"settings.fallback_browser.subtitle" = "Używana, gdy żadna reguła nie pasuje i wybrano 'Otwórz w domyślnej przeglądarce'";

"settings.notify_fallback.title" = "Pokazuj powiadomienie o użyciu domyślnej przeglądarki";
"settings.notify_fallback.subtitle" = "Otrzymuj powiadomienie, gdy adres URL zostanie otwarty w domyślnej przeglądarce";

"settings.tooltips.title" = "Pokazuj podpowiedzi";
"settings.tooltips.subtitle" = "Wyświetlaj przydatne wskazówki przy najechaniu na elementy interfejsu";
"settings.tooltips.enable_rules" = "Włącz lub wyłącz wszystkie reguły routingu przeglądarek. Gdy wyłączone, wszystkie reguły są ignorowane i używane jest domyślne zachowanie.";
"settings.tooltips.launch_at_login" = "Gdy włączone, Proxly uruchomi się automatycznie podczas logowania do Maca, zapewniając, że reguły są zawsze aktywne.";
"settings.tooltips.default_behavior" = "Wybierz, co się dzieje, gdy żadna reguła nie pasuje do adresu URL: pokaż okno wyboru przeglądarki lub automatycznie otwórz w domyślnej przeglądarce.";
"settings.tooltips.fallback_browser" = "Wybierz przeglądarkę do użycia jako domyślną, gdy żadna reguła nie pasuje i wybrana jest opcja domyślnej przeglądarki.";
"settings.tooltips.notify_fallback" = "Gdy włączone, otrzymasz powiadomienie za każdym razem, gdy adres URL zostanie otwarty w domyślnej przeglądarce.";
"settings.tooltips.enable_logging" = "Włącz rejestrowanie, aby pomóc w diagnozowaniu problemów. Proxly będzie rejestrować otwarte adresy URL i komunikaty diagnostyczne. Nie są zbierane żadne dane osobowe.";
"settings.tooltips.show_tooltips" = "Przełącz to ustawienie, aby pokazać lub ukryć przydatne podpowiedzi przy najechaniu na elementy interfejsu.";

"settings.logging.enable" = "Włącz dziennikowanie";
"settings.logging.subtitle" = "Gdy ta opcja jest włączona, Proxly będzie rejestrować otwierane URL oraz wiadomości diagnostyczne. Żadne dane nie są zbierane.";

// MARK: - Notifications
"notification.permission.title" = "Wymagane pozwolenie na powiadomienia";
"notification.permission.message" = "Proxly potrzebuje pozwolenia na wysyłanie powiadomień. Włącz powiadomienia w Ustawieniach Systemowych.";
"notification.denied.title" = "Odmowa powiadomień";
"notification.denied.message" = "Wcześniej odmówiłeś pozwolenia na powiadomienia. Włącz powiadomienia w Ustawieniach Systemowych, jeśli chcesz otrzymywać alerty.";
"notification.fallback.title" = "Użyto domyślnej przeglądarki";
"notification.fallback.body" = "Otwarto adres URL w domyślnej przeglądarce: %@";

// MARK: - Rules View
"rules.title" = "Reguły";
"rules.status.enabled" = "Włączone";
"rules.status.disabled" = "Wyłączone";
"rules.empty.title" = "Brak reguł";
"rules.empty.subtitle" = "Stwórz swoją pierwszą regułę, aby inteligentnie zarządzać adresami URL";
"rules.empty.description" = "Reguły pozwalają automatycznie otwierać różne strony internetowe w określonych przeglądarkach w zależności od domen, trybów skupienia lub pory dnia.";
"rules.select.title" = "Wybierz regułę";
"rules.select.subtitle" = "Wybierz regułę z listy, aby wyświetlić i edytować jej szczególy";
"rules.priority.title" = "Priorytet";

// MARK: - Rule Edit View
"rule.edit.title.new" = "Dodaj regułę";
"rule.edit.title.edit" = "Edytuj regułę";
"rule.edit.name.placeholder" = "Wprowadź nazwę reguły";
"rule.edit.name.empty" = "Nazwa reguły nie może być pusta";
"rule.edit.name.valid" = "Nazwa reguły jest prawidłowa";
"rule.edit.saved.title" = "Reguła zapisana";
"rule.edit.section.name" = "Nazwa";
"rule.edit.section.type" = "Typ reguły";
"rule.edit.section.condition" = "Warunek";
"rule.edit.section.browser" = "Przeglądarka docelowa";
"rule.edit.section.priority" = "Priorytet";

"rule.condition.placeholder" = "np. apple.com lub Praca";
"rule.validation.empty" = "Warunek nie może być pusty.";
"rule.validation.duplicate" = "Reguła o tym typie i warunku już istnieje.";
"rule.validation.valid" = "Warunek jest prawidłowy";

"rule.priority.title" = "Poziom priorytetu";
"rule.priority.subtitle" = "Reguły o wyższym priorytecie są oceniane jako pierwsze";

"rule.delete.title" = "Usuń regułę";
"rule.delete.message" = "Czy na pewno chcesz usunąć tę regułę? Tej operacji nie można cofnąć.";

// MARK: - Rule Types
"rule_type.domain" = "Domena";
"rule_type.focus_mode" = "Tryb skupienia";
"rule_type.time" = "Czas";

// MARK: - Time-Based Rules
"time_rule.time.start" = "Czas rozpoczęcia";
"time_rule.time.end" = "Czas zakończenia";
"time_rule.time.section_title" = "Zakres czasowy";
"time_rule.time.overnight_warning" = "Ta reguła będzie aktywna przez noc (przekracza północ)";
"time_rule.time.active_preview" = "Aktywna od %@ do %@";

"time_rule.days.section_title" = "Dni tygodnia";
"time_rule.days.weekdays" = "Dni robocze";
"time_rule.days.weekends" = "Weekendy";
"time_rule.days.all_days" = "Wszystkie dni";
"time_rule.days.clear" = "Wyczyść";

"time_rule.days.sunday" = "Niedziela";
"time_rule.days.monday" = "Poniedziałek";
"time_rule.days.tuesday" = "Wtorek";
"time_rule.days.wednesday" = "Środa";
"time_rule.days.thursday" = "Czwartek";
"time_rule.days.friday" = "Piątek";
"time_rule.days.saturday" = "Sobota";

"time_rule.days.sun" = "Ndz";
"time_rule.days.mon" = "Pon";
"time_rule.days.tue" = "Wt";
"time_rule.days.wed" = "Śr";
"time_rule.days.thu" = "Czw";
"time_rule.days.fri" = "Pt";
"time_rule.days.sat" = "Sob";

"time_rule.days.active_on" = "Aktywna w: %@";

"time_rule.preview.title" = "Podgląd reguły";
"time_rule.preview.summary" = "Aktywna w %@ od %@ do %@";
"time_rule.preview.every_day" = "Codziennie";

"time_rule.validation.invalid_time_range" = "Czas rozpoczęcia i zakończenia nie może być identyczny";
"time_rule.validation.no_days_selected" = "Proszę wybrać co najmniej jeden dzień";
"time_rule.validation.duplicate_range" = "Ten zakres czasowy już istnieje dla wybranych dni";

// MARK: - Browser Selection
"browser_selection.title" = "Wybierz przeglądarkę";
"browser_selection.subtitle" = "Wybierz, która przeglądarka ma otworzyć ten link";
"browser_selection.url_label" = "Otwieranie:";
"browser_selection.remember" = "Zapamiętaj ten wybór";
"browser_selection.action" = "Otwórz";

// MARK: - About View
"about.title" = "O programie";
"about.app_subtitle" = "Inteligentny wybór przeglądarki";
"about.version" = "Wersja";
"about.build" = "Kompilacja";

"about.section.what_is" = "Czym jest Proxly?";
"about.description.main" = "Proxly to inteligentny menedżer przeglądarek, który automatycznie kieruje linki internetowe do odpowiedniej przeglądarki na podstawie dostosowywalnych reguł.";
"about.description.detail" = "Nigdy więcej nie martw się o otwieranie linków służbowych w przeglądarce osobistej i na odwrót. Skonfiguruj reguły oparte na domenach, trybach skupienia lub porze dnia, a Proxly zajmie się resztą.";

"about.section.features" = "Kluczowe funkcje";
"about.feature.domain_rules.title" = "Reguły oparte na domenach";
"about.feature.domain_rules.description" = "Kieruj określone strony internetowe do wyznaczonych przeglądarek";
"about.feature.focus_mode.title" = "Integracja z trybem skupienia";
"about.feature.focus_mode.description" = "Różne przeglądarki do pracy i czasu wolnego";
"about.feature.time_based.title" = "Routing oparty na czasie";
"about.feature.time_based.description" = "Automatyczny wybór przeglądarki w zależności od pory dnia";
"about.feature.priority.title" = "System priorytetów";
"about.feature.priority.description" = "Dostosuj pierwszeństwo reguł za pomocą poziomów priorytetów";

"about.feature.menu_bar.title" = "Integracja z paskiem menu";
"about.feature.menu_bar.description" = "Szybki dostęp do reguł i ustawień z paska menu";

"about.section.developer" = "Deweloper";
"about.developer.name" = "Paweł Mazurkiewicz";
"about.developer.role" = "macOS Developer";
"about.developer.description" = "Tworzy piękne, funkcjonalne aplikacje na Maca";

"about.section.links" = "Linki i wsparcie";
"about.link.website" = "Strona internetowa";
"about.link.support" = "Wsparcie";
"about.link.support_description" = "Potrzebujesz wsparcia? Daj mi znać!";
"about.link.feature_request" = "Zaproponuj funkcję";
"about.link.feature_request_description" = "Masz pomysł na nową funkcję? Podziel się nim!";
"about.link.rate" = "Oceń Proxly w App Store";
"about.link.rate_description" = "Jeśli podoba Ci się używanie Proxly, rozważ pozostawienie oceny w App Store!";
"about.link.github" = "Kod źródłowy";

// MARK: - Menu Bar
"menu.toggle_rules" = "Włącz/Wyłącz reguły";
"menu.open_settings" = "Otwórz ustawienia...";
"menu.quit" = "Zakończ Proxly";

// MARK: - Errors
"error.app_not_found" = "Nie znaleziono aplikacji o identyfikatorze '%@'.";
"error.open_failed" = "Nie udało się otworzyć adresu URL: %@";

/* Rule List */
"rule_list_title" = "Reguły";
"rule_list_subtitle" = "Zarządzaj regułami routingu przeglądarki";
"rule_list_browser" = "Przeglądarka";
"rule_list_priority" = "Priorytet";

// MARK: - Focus Mode
"focus.app_filter.title" = "Filtr trybu skupienia aplikacji";
"focus.app_filter.description" = "Skonfiguruj zachowanie aplikacji dla różnych trybów skupienia";
"focus.display_representation.title" = "Tryb skupienia: %@";
"focus.display_representation.subtitle" = "Niestandardowe zachowanie aplikacji dla tego trybu skupienia";
"focus.unnamed" = "Bez nazwy";

"focus.status.not_determined" = "Nie określono";
"focus.status.restricted" = "Ograniczony";
"focus.status.denied" = "Odrzucony";
"focus.status.authorized" = "Autoryzowany";
"focus.status.unknown" = "Nieznany";

"focus.info.status.active" = "Aktywny";
"focus.info.status.inactive" = "Nieaktywny";
"focus.info.authorization" = "Autoryzacja";
"focus.info.name" = "Nazwa trybu skupienia";
"focus.info.name.not_available" = "Niedostępna (wymaga konfiguracji przez użytkownika)";

// MARK: - Focus Suggestions
"focus.suggestion.work" = "Praca";
"focus.suggestion.personal" = "Osobisty";
"focus.suggestion.sleep" = "Sen";
"focus.suggestion.do_not_disturb" = "Nie przeszkadzać";

// MARK: - Accessibility
"accessibility.section.label" = "Sekcja";

// Rule Edit Accessibility
"accessibility.rule_edit.name.label" = "Nazwa reguły";
"accessibility.rule_edit.name.hint" = "Wprowadź opisową nazwę dla tej reguły";

"accessibility.rule_edit.rule_type.section_label" = "Wybór typu reguły";
"accessibility.rule_edit.rule_type.domain.label" = "Reguła oparta na domenie";
"accessibility.rule_edit.rule_type.domain.hint" = "Utwórz regułę, która pasuje do domen stron internetowych";
"accessibility.rule_edit.rule_type.focus_mode.label" = "Reguła trybu koncentracji";
"accessibility.rule_edit.rule_type.focus_mode.hint" = "Utwórz regułę, która aktywuje się podczas określonych trybów koncentracji";
"accessibility.rule_edit.rule_type.time.label" = "Reguła oparta na czasie";
"accessibility.rule_edit.rule_type.time.hint" = "Utwórz regułę, która aktywuje się w określonych godzinach i dniach";

"accessibility.rule_edit.condition.label" = "Warunek reguły";
"accessibility.rule_edit.condition.hint" = "Wprowadź warunek, który uruchomi tę regułę";
"accessibility.rule_edit.condition.section_label" = "Warunek reguły";

"accessibility.rule_edit.browser.section_label" = "Wybór przeglądarki docelowej";
"accessibility.rule_edit.browser.selected_hint" = "Dotknij, aby wybrać inną przeglądarkę";
"accessibility.rule_edit.browser.unselected_hint" = "Dotknij, aby wybrać tę przeglądarkę";
"accessibility.rule_edit.browser.selected_label" = "Przeglądarka %@, obecnie wybrana";
"accessibility.rule_edit.browser.unselected_label" = "Przeglądarka %@, nie wybrana";

"accessibility.rule_edit.browser_row.selected_label" = "Wybrana przeglądarka";
"accessibility.rule_edit.browser_row.unselected_label" = "Dostępna przeglądarka";
"accessibility.rule_edit.browser_row.selected_hint" = "Ta przeglądarka jest obecnie wybrana dla tej reguły";
"accessibility.rule_edit.browser_row.unselected_hint" = "Dotknij, aby wybrać tę przeglądarkę dla tej reguły";

"accessibility.rule_edit.priority.label" = "Priorytet reguły";
"accessibility.rule_edit.priority.hint" = "Dostosuj poziom priorytetu dla tej reguły. Reguły o wyższym priorytecie mają pierwszeństwo w swojej klasie.";
"accessibility.rule_edit.priority.section_label" = "Ustawienie priorytetu";
"accessibility.rule_edit.priority.value_label" = "Poziom priorytetu %d";

"accessibility.rule_edit.button.save.hint" = "Zapisz bieżącą konfigurację reguły";
"accessibility.rule_edit.button.save.hint_disabled" = "Wypełnij wszystkie wymagane pola, aby zapisać regułę";
"accessibility.rule_edit.button.cancel.hint" = "Anuluj edycję i odrzuć zmiany";
"accessibility.rule_edit.button.delete.hint" = "Usuń tę regułę na stałe";
"accessibility.rule_edit.button.delete.label" = "Usuń regułę";

"accessibility.rule_edit.validation.error_label" = "Błąd walidacji";
"accessibility.rule_edit.validation.success_label" = "Walidacja pomyślna";

"accessibility.rule_edit.success.label" = "Reguła zapisana pomyślnie";
"accessibility.rule_edit.success.hint" = "Reguła została zapisana i jest teraz aktywna";

// General Accessibility
"accessibility.general.section_header" = "Nagłówek sekcji";
"accessibility.general.validation_message" = "Komunikat walidacji";
"accessibility.general.success_indicator" = "Wskaźnik sukcesu";

// Browser Selection Accessibility
"accessibility.browser_selection.row_label" = "Opcja przeglądarki";
"accessibility.browser_selection.selected_state" = "Wybrana";
"accessibility.browser_selection.unselected_state" = "Nie wybrana";

// Time-Based Rule Accessibility
"accessibility.time_based_rule.time_range.section_label" = "Ustawienia zakresu czasowego";
"accessibility.time_based_rule.time_range.start_time_label" = "Czas początkowy";
"accessibility.time_based_rule.time_range.end_time_label" = "Czas końcowy";
"accessibility.time_based_rule.time_range.start_time_hint" = "Ustaw czas, o którym ta reguła staje się aktywna";
"accessibility.time_based_rule.time_range.end_time_hint" = "Ustaw czas, o którym ta reguła staje się nieaktywna";

"accessibility.time_based_rule.day_selection.section_label" = "Wybór dni";
"accessibility.time_based_rule.day_selection.day_selected_hint" = "Ten dzień jest uwzględniony w regule";
"accessibility.time_based_rule.day_selection.day_unselected_hint" = "Dotknij, aby uwzględnić ten dzień w regule";

"accessibility.time_based_rule.preview.label" = "Podgląd reguły";
"accessibility.time_based_rule.preview.hint" = "Podsumowanie, kiedy ta reguła będzie aktywna";

"accessibility.time_based_rule.time_range.overnight_warning_label" = "Ostrzeżenie o zakresie nocnym: ta reguła będzie aktywna po północy";
"accessibility.time_based_rule.time_range.preview_label" = "Podgląd aktywnego zakresu czasu";
"accessibility.time_based_rule.day_selection.day_button_label" = "Dzień: %@, Status: %@";
"accessibility.time_based_rule.day_selection.clear_button_label" = "Wyczyść zaznaczenie";
"accessibility.time_based_rule.day_selection.clear_button_hint" = "Dotknij, aby odznaczyć wszystkie dni tygodnia";
"accessibility.time_based_rule.day_selection.preset_button_label" = "Ustawienie: %@, Status: %@";
"accessibility.time_based_rule.day_selection.preset_button_hint" = "Dotknij, aby zastosować ustawienie dni, takie jak dni robocze lub weekendy";
"accessibility.time_based_rule.day_selection.selected_days_preview_label" = "Podgląd wybranych dni";

// MARK: - Accessibility Strings for Settings
"accessibility.settings.toolbar.title.label" = "Ustawienia Proxly";
"accessibility.settings.toolbar.title.hint" = "Główna strona ustawień dla konfiguracji aplikacji Proxly";

// Settings - General Section
"accessibility.settings.general.section_label" = "Sekcja Ustawień Ogólnych";
"accessibility.settings.general.enable_rules.label" = "Przełącznik włączania reguł";
"accessibility.settings.general.enable_rules.hint" = "Gdy włączone, wszystkie reguły będą aktywne. Gdy wyłączone, wszystkie reguły będą ignorowane";
"accessibility.settings.general.enable_rules.value.enabled" = "Reguły są włączone";
"accessibility.settings.general.enable_rules.value.disabled" = "Reguły są wyłączone";
"accessibility.settings.general.launch_at_login.label" = "Przełącznik uruchamiania przy logowaniu";
"accessibility.settings.general.launch_at_login.hint" = "Gdy włączone, Proxly automatycznie uruchomi się podczas logowania do Maca";
"accessibility.settings.general.launch_at_login.value.enabled" = "Uruchamianie przy logowaniu jest włączone";
"accessibility.settings.general.launch_at_login.value.disabled" = "Uruchamianie przy logowaniu jest wyłączone";

// Settings - Default Behavior Section
"accessibility.settings.default_behavior.section_label" = "Sekcja Ustawień Domyślnego Zachowania";
"accessibility.settings.default_behavior.picker.label" = "Selektor domyślnego zachowania";
"accessibility.settings.default_behavior.picker.hint" = "Wybierz, co się dzieje, gdy żadna reguła nie pasuje do adresu URL. Pokaż wybór przeglądarki lub otwórz przeglądarkę zapasową";
"accessibility.settings.default_behavior.picker.value" = "Obecnie ustawione na %@";
"accessibility.settings.fallback_browser.picker.label" = "Selektor przeglądarki zapasowej";
"accessibility.settings.fallback_browser.picker.hint" = "Wybierz, której przeglądarki użyć jako zapasowej, gdy żadna reguła nie pasuje i opcja zapasowa jest wybrana";
"accessibility.settings.fallback_browser.picker.value" = "Obecnie ustawione na %@";
"accessibility.settings.refresh_browsers.label" = "Przycisk odświeżania przeglądarek";
"accessibility.settings.refresh_browsers.hint" = "Dotknij, aby odświeżyć listę dostępnych przeglądarek";
"accessibility.settings.notify_fallback.label" = "Przełącznik powiadomień o zapasowej";
"accessibility.settings.notify_fallback.hint" = "Gdy włączone, otrzymasz powiadomienie, gdy adres URL zostanie otwarty w przeglądarce zapasowej";
"accessibility.settings.notify_fallback.value.enabled" = "Powiadomienia zapasowe są włączone";
"accessibility.settings.notify_fallback.value.disabled" = "Powiadomienia zapasowe są wyłączone";

// Settings - Logging Section
"accessibility.settings.logging.section_label" = "Sekcja Ustawień Logowania";
"accessibility.settings.logging.enable.label" = "Przełącznik włączania logowania";
"accessibility.settings.logging.enable.hint" = "Gdy włączone, Proxly będzie rejestrować otwarte adresy URL i komunikaty diagnostyczne do rozwiązywania problemów";
"accessibility.settings.logging.enable.value.enabled" = "Logowanie jest włączone";
"accessibility.settings.logging.enable.value.disabled" = "Logowanie jest wyłączone";

// MARK: - Missing Strings
"Navigation Tab Bar" = "Pasek Zakładek Nawigacji";
"Unknown Browser" = "Nieznana Przeglądarka";
"%@ %lld" = "%@ %lld";
"" = "";

// MARK: - Direct Settings Accessibility Keys (matching LocalizationHelper structure)
"accessibility.settings.enable_rules.label" = "Przełącznik włączania reguł";
"accessibility.settings.enable_rules.hint" = "Gdy włączone, wszystkie reguły będą aktywne. Gdy wyłączone, wszystkie reguły będą ignorowane";
"accessibility.settings.enable_rules.value.enabled" = "Reguły są włączone";
"accessibility.settings.enable_rules.value.disabled" = "Reguły są wyłączone";
"accessibility.settings.launch_at_login.label" = "Przełącznik uruchamiania przy logowaniu";
"accessibility.settings.launch_at_login.hint" = "Gdy włączone, Proxly będzie automatycznie uruchamiany przy logowaniu do Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Uruchamianie przy logowaniu jest włączone";
"accessibility.settings.launch_at_login.value.disabled" = "Uruchamianie przy logowaniu jest wyłączone";

// MARK: - About Accessibility
"accessibility.about.toolbar.title.label" = "O programie Proxly";
"accessibility.about.toolbar.title.hint" = "Informacje o aplikacji Proxly, jej funkcjach i deweloperze";

"accessibility.about.navigation.scroll_view.label" = "Informacje o aplikacji";
"accessibility.about.navigation.scroll_view.hint" = "Przewiń aby zobaczyć informacje o aplikacji, funkcje i linki";

"accessibility.about.app_info.section_label" = "Informacje o aplikacji";
"accessibility.about.app_info.app_icon.label" = "Ikona aplikacji Proxly";
"accessibility.about.app_info.app_icon.hint" = "Oficjalna ikona aplikacji Proxly";
"accessibility.about.app_info.app_name.label" = "Proxly - Inteligentny router przeglądarek";
"accessibility.about.app_info.app_subtitle.label" = "Inteligentne kierowanie przeglądarek dla macOS";
"accessibility.about.app_info.version_badge.label" = "%@ %@";
"accessibility.about.app_info.version_badge.hint" = "Informacje o wersji aplikacji i kompilacji";

"accessibility.about.description.section_label" = "Opis aplikacji";
"accessibility.about.description.section_hint" = "Dowiedz się co robi Proxly i jak pomaga w zarządzaniu przeglądarkami";
"accessibility.about.description.main_text.label" = "Główny opis aplikacji";
"accessibility.about.description.detail_text.label" = "Szczegółowy opis aplikacji";

"accessibility.about.features.section_label" = "Funkcje aplikacji";
"accessibility.about.features.section_hint" = "Odkryj wszystkie potężne funkcje, które oferuje Proxly";
"accessibility.about.features.feature_row.label" = "Funkcja: %@";
"accessibility.about.features.feature_row.hint" = "Opis: %@";
"accessibility.about.features.feature_list.label" = "Lista funkcji Proxly";

"accessibility.about.developer.section_label" = "Informacje o deweloperze";
"accessibility.about.developer.section_hint" = "Poznaj osobę, która stworzyła Proxly";
"accessibility.about.developer.photo.label" = "Zdjęcie dewelopera";
"accessibility.about.developer.photo.hint" = "Zdjęcie Pawła Mazurkiewicza, dewelopera Proxly";
"accessibility.about.developer.name.label" = "Imię dewelopera: Paweł Mazurkiewicz";
"accessibility.about.developer.role.label" = "Rola: macOS Developer";
"accessibility.about.developer.description.label" = "Bio: Tworzy piękne, funkcjonalne aplikacje na Maca";

"accessibility.about.links.section_label" = "Linki i wsparcie";
"accessibility.about.links.section_hint" = "Dostęp do wsparcia, prośby o funkcje i ocena aplikacji";
"accessibility.about.links.link_button.label" = "Przycisk %@";
"accessibility.about.links.link_button.hint" = "%@ - dotknij aby otworzyć";
"accessibility.about.links.support_button.label" = "Skontaktuj się ze wsparciem";
"accessibility.about.links.support_button.hint" = "Wyślij e-mail aby uzyskać pomoc z Proxly lub zgłosić błędy";
"accessibility.about.links.feature_request_button.label" = "Zaproponuj funkcję";
"accessibility.about.links.feature_request_button.hint" = "Wyślij e-mail aby zasugerować nowe funkcje dla Proxly";
"accessibility.about.links.rate_button.label" = "Oceń w App Store";
"accessibility.about.links.rate_button.hint" = "Otwórz App Store aby ocenić i skomentować Proxly";

// MARK: - Additional Settings Accessibility
"accessibility.settings.enable_rules.label" = "Przełącznik włączania reguł";
"accessibility.settings.enable_rules.hint" = "Gdy włączone, wszystkie reguły będą aktywne. Gdy wyłączone, wszystkie reguły będą ignorowane";
"accessibility.settings.enable_rules.value.enabled" = "Reguły są włączone";
"accessibility.settings.enable_rules.value.disabled" = "Reguły są wyłączone";
"accessibility.settings.launch_at_login.label" = "Przełącznik uruchamiania przy logowaniu";
"accessibility.settings.launch_at_login.hint" = "Gdy włączone, Proxly będzie automatycznie uruchamiany przy logowaniu do Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Uruchamianie przy logowaniu jest włączone";
"accessibility.settings.launch_at_login.value.disabled" = "Uruchamianie przy logowaniu jest wyłączone";

// MARK: - ContentView Accessibility
"accessibility.content_view.container_label" = "Główne Okno Proxly";
"accessibility.content_view.container_hint" = "Główne okno aplikacji zawierające zakładki nawigacyjne dla Reguł, Ustawień i O programie";

"accessibility.content_view.tab_view.container_label" = "Główna Nawigacja";
"accessibility.content_view.tab_view.container_hint" = "Nawigacja zakładkowa do przełączania między różnymi sekcjami Proxly";

"accessibility.content_view.tab.rules.label" = "Zakładka Reguły";
"accessibility.content_view.tab.rules.hint" = "Dotknij aby zobaczyć i zarządzać regułami kierowania przeglądarek";
"accessibility.content_view.tab.rules.selected" = "Zakładka reguły wybrana";
"accessibility.content_view.tab.rules.unselected" = "Zakładka reguły nie wybrana";

"accessibility.content_view.tab.settings.label" = "Zakładka Ustawienia";
"accessibility.content_view.tab.settings.hint" = "Dotknij aby zobaczyć i modyfikować ustawienia aplikacji";
"accessibility.content_view.tab.settings.selected" = "Zakładka ustawienia wybrana";
"accessibility.content_view.tab.settings.unselected" = "Zakładka ustawienia nie wybrana";

"accessibility.content_view.tab.about.label" = "Zakładka O programie";
"accessibility.content_view.tab.about.hint" = "Dotknij aby zobaczyć informacje o Proxly i szczegóły dewelopera";
"accessibility.content_view.tab.about.selected" = "Zakładka o programie wybrana";
"accessibility.content_view.tab.about.unselected" = "Zakładka o programie nie wybrana";

// MARK: - Rule List Accessibility
"accessibility.rule_list.navigation.container_label" = "Nawigacja Reguł";
"accessibility.rule_list.navigation.container_hint" = "Nawigacja podzielonego widoku zawierająca listę reguł i interfejs edycji";
"accessibility.rule_list.navigation.sidebar_label" = "Pasek Boczny Reguł";
"accessibility.rule_list.navigation.sidebar_hint" = "Lista wszystkich twoich reguł routingu przeglądarki";

"accessibility.rule_list.toolbar.title_label" = "Tytuł Ekranu Reguł";
"accessibility.rule_list.toolbar.title_hint" = "Główny tytuł dla ekranu zarządzania regułami";

"accessibility.rule_list.button.add_rule_label" = "Dodaj Regułę";
"accessibility.rule_list.button.add_rule_hint" = "Dotknij aby utworzyć nową regułę routingu przeglądarki";

"accessibility.rule_list.toggle.rules_enabled_label" = "Przełącznik Włączonych Reguł";
"accessibility.rule_list.toggle.rules_enabled_hint" = "Przełącz aby włączyć lub wyłączyć wszystkie reguły. Gdy wyłączone, wszystkie reguły będą ignorowane";
"accessibility.rule_list.toggle.rules_enabled_value_on" = "Reguły są włączone";
"accessibility.rule_list.toggle.rules_enabled_value_off" = "Reguły są wyłączone";

"accessibility.rule_list.empty_state.container_label" = "Komunikat Brak Reguł";
"accessibility.rule_list.empty_state.container_hint" = "Wyświetlanie informacji gdy nie zostały jeszcze utworzone reguły";
"accessibility.rule_list.empty_state.description_label" = "Opis Brak Reguł";
"accessibility.rule_list.empty_state.description_hint" = "Wyjaśnienie czym są reguły i dlaczego są przydatne";
"accessibility.rule_list.empty_state.create_button_label" = "Utwórz Pierwszą Regułę";
"accessibility.rule_list.empty_state.create_button_hint" = "Dotknij aby utworzyć swoją pierwszą regułę routingu przeglądarki";

"accessibility.rule_list.list.scroll_view_label" = "Lista Reguł";
"accessibility.rule_list.list.scroll_view_hint" = "Lista przewijalna zawierająca %d reguł";

"accessibility.rule_list.rule_card.button_label" = "Reguła %@";
"accessibility.rule_list.rule_card.button_hint" = "Dotknij aby zobaczyć i edytować tę regułę";
"accessibility.rule_list.rule_card.selected_value" = "Wybrane";

// MARK: - SelectionPanel Accessibility
"accessibility.selection_panel.container.label" = "Panel Wyboru Przeglądarki";
"accessibility.selection_panel.container.hint" = "Panel do wyboru przeglądarki do otwarcia adresu URL";
"accessibility.selection_panel.container.role_description" = "Dialog wyboru";

"accessibility.selection_panel.header.section_label" = "Nagłówek Panelu";
"accessibility.selection_panel.header.title.label" = "Tytuł: Wybierz przeglądarkę";
"accessibility.selection_panel.header.title.hint" = "Główny tytuł panelu wyboru przeglądarki";
"accessibility.selection_panel.header.subtitle.label" = "Podtytuł: Wybierz, która przeglądarka ma otworzyć ten link";
"accessibility.selection_panel.header.subtitle.hint" = "Instrukcje dotyczące wyboru przeglądarki";
"accessibility.selection_panel.header.icon.label" = "Ikona wyboru przeglądarki";

"accessibility.selection_panel.browser_grid.container.label" = "Siatka Przeglądarek";
"accessibility.selection_panel.browser_grid.container.hint" = "Siatka %d dostępnych przeglądarek do wyboru";
"accessibility.selection_panel.browser_grid.section_label" = "Dostępne Przeglądarki";

"accessibility.selection_panel.browser_card.button.label" = "Przeglądarka %@";
"accessibility.selection_panel.browser_card.button.label_with_shortcut" = "Przeglądarka %@, skrót %@";
"accessibility.selection_panel.browser_card.button.hint" = "Dotknij aby otworzyć link w %@";
"accessibility.selection_panel.browser_card.button.hint_with_shortcut" = "Dotknij lub naciśnij %@ aby otworzyć link w %@";
"accessibility.selection_panel.browser_card.icon.label" = "Ikona %@";
"accessibility.selection_panel.browser_card.name.label" = "Nazwa przeglądarki: %@";
"accessibility.selection_panel.browser_card.shortcut_badge.label" = "Skrót klawiszowy %@";
"accessibility.selection_panel.browser_card.shortcut_badge.hint" = "Naciśnij %@ aby szybko wybrać tę przeglądarkę";

"accessibility.selection_panel.url_section.container.label" = "Sekcja Adresu URL";
"accessibility.selection_panel.url_section.container.hint" = "Informacje o adresie URL, który ma zostać otwarty";
"accessibility.selection_panel.url_section.icon.label" = "Ikona linku";
"accessibility.selection_panel.url_section.title.label" = "Etykieta: Otwieranie";
"accessibility.selection_panel.url_section.title.hint" = "Etykieta wskazująca adres URL do otwarcia";
"accessibility.selection_panel.url_section.url.label" = "Adres URL do otwarcia";
"accessibility.selection_panel.url_section.url.hint" = "Pełny adres URL, który zostanie otwarty w wybranej przeglądarce";

"accessibility.selection_panel.action_section.container.label" = "Sekcja Akcji";
"accessibility.selection_panel.action_section.container.hint" = "Opcje akcji i instrukcje dla panelu";
"accessibility.selection_panel.action_section.instructions.label" = "Instrukcje: Wybierz przeglądarkę lub naciśnij Escape aby anulować";
"accessibility.selection_panel.action_section.instructions.hint" = "Instrukcje dotyczące korzystania z panelu wyboru";
"accessibility.selection_panel.action_section.cancel_button.label" = "Anuluj";
"accessibility.selection_panel.action_section.cancel_button.hint" = "Dotknij aby zamknąć panel bez wybierania przeglądarki";

"accessibility.selection_panel.navigation.focus_moved" = "Fokus przesunięty na %@";

"accessibility.selection_panel.actions.select_browser" = "Wybierz przeglądarkę %@";
"accessibility.selection_panel.actions.cancel" = "Anuluj wybór przeglądarki";
"accessibility.selection_panel.actions.dismiss" = "Zamknij panel wyboru";

"accessibility.selection_panel.announcements.panel_opened" = "Panel wyboru przeglądarki otwarty. %d przeglądarek dostępnych.";
"accessibility.selection_panel.announcements.panel_closed" = "Panel wyboru przeglądarki zamknięty";
"accessibility.selection_panel.announcements.browser_focused" = "Skupiony na przeglądarce %@";
"accessibility.selection_panel.announcements.browser_selected" = "Wybrano przeglądarkę %@";
"accessibility.selection_panel.announcements.auto_dismiss_warning" = "Panel zostanie automatycznie zamknięty za %d sekund";
"accessibility.rule_list.rule_card.unselected_value" = "Nie wybrane";

"accessibility.rule_list.rule_card.type_label" = "Typ reguły: %@";
"accessibility.rule_list.rule_card.type_hint" = "Typ warunku z którym ta reguła się dopasowuje";

"accessibility.rule_list.rule_card.name_label" = "Nazwa reguły: %@";

"accessibility.rule_list.rule_card.condition_label" = "Warunek: %@";

"accessibility.rule_list.rule_card.browser_label" = "Docelowa przeglądarka: %@";
"accessibility.rule_list.rule_card.browser_hint" = "Przeglądarka która będzie otwierać linki pasujące do tej reguły";

"accessibility.rule_list.rule_card.priority_label" = "Priorytet: %d";
"accessibility.rule_list.rule_card.priority_hint" = "Poziom priorytetu reguły - wyższe liczby mają pierwszeństwo";

"accessibility.rule_list.detail.edit_view_label" = "Edytuj Regułę %@";
"accessibility.rule_list.detail.edit_view_hint" = "Interfejs edycji reguły do modyfikacji ustawień reguły";
"accessibility.rule_list.detail.placeholder_label" = "Wybierz Regułę";
"accessibility.rule_list.detail.placeholder_hint" = "Wybierz regułę z listy aby zobaczyć i edytować jej szczegóły";

// MARK: - MenuBarManager Accessibility
"accessibility.menu_bar_manager.status_item.label" = "Przycisk Statusu Proxly";
"accessibility.menu_bar_manager.status_item.hint_enabled" = "Kliknij aby otworzyć menu Proxly. Reguły są włączone";
"accessibility.menu_bar_manager.status_item.hint_disabled" = "Kliknij aby otworzyć menu Proxly. Reguły są wyłączone";
"accessibility.menu_bar_manager.status_item.role_description" = "Aplikacja paska menu Proxly";
"accessibility.menu_bar_manager.status_item.value_enabled" = "Reguły włączone";
"accessibility.menu_bar_manager.status_item.value_disabled" = "Reguły wyłączone";

"accessibility.menu_bar_manager.menu.container_label" = "Menu Proxly";
"accessibility.menu_bar_manager.menu.container_hint" = "Główne menu z opcjami dla reguł, ustawień i kontroli aplikacji";

"accessibility.menu_bar_manager.menu.toggle_rules.label" = "Przełącz Reguły";
"accessibility.menu_bar_manager.menu.toggle_rules.hint" = "Włącz lub wyłącz wszystkie reguły routingu przeglądarek";
"accessibility.menu_bar_manager.menu.open_settings.label" = "Otwórz Ustawienia";
"accessibility.menu_bar_manager.menu.open_settings.hint" = "Otwórz ustawienia Proxly aby skonfigurować aplikację";
"accessibility.menu_bar_manager.menu.quit.label" = "Wyjdź z Proxly";
"accessibility.menu_bar_manager.menu.quit.hint" = "Zamknij aplikację Proxly";

"accessibility.menu_bar_manager.actions.toggle_rules_description" = "Przełącz Reguły";
"accessibility.menu_bar_manager.actions.open_settings_description" = "Otwórz Ustawienia";
"accessibility.menu_bar_manager.actions.quit_description" = "Wyjdź z Proxly";

// MARK: - Onboarding
"onboarding.container.label" = "Wprowadzenie";
"onboarding.container.hint" = "Witamy w wprowadzeniu do Proxly. Poznaj funkcje aplikacji i zacznij.";

// Onboarding Pages
"onboarding.page.welcome.label" = "Strona powitalna";
"onboarding.page.welcome.hint" = "Wprowadzenie do aplikacji Proxly";
"onboarding.page.what_is.label" = "Strona czym jest Proxly";
"onboarding.page.what_is.hint" = "Dowiedz się, co robi Proxly i jak to działa";
"onboarding.page.rules.label" = "Strona reguł";
"onboarding.page.rules.hint" = "Zrozum, jak działają reguły w Proxly";
"onboarding.page.menu_bar.label" = "Strona paska menu";
"onboarding.page.menu_bar.hint" = "Dowiedz się o integracji z paskiem menu";
"onboarding.page.focus_modes.label" = "Strona trybów skupienia";
"onboarding.page.focus_modes.hint" = "Odkryj integrację z Trybem Skupienia";
"onboarding.page.get_started.label" = "Strona rozpoczęcia";
"onboarding.page.get_started.hint" = "Dokończ konfigurację i zacznij używać Proxly";

// Onboarding Controls
"onboarding.button.previous" = "Poprzedni";
"onboarding.button.previous.label" = "Poprzednia strona";
"onboarding.button.previous.hint" = "Przejdź do poprzedniej strony wprowadzenia";
"onboarding.button.next" = "Następny";
"onboarding.button.next.label" = "Następna strona";
"onboarding.button.next.hint" = "Przejdź do następnej strony wprowadzenia";
"onboarding.button.get_started" = "Rozpocznij";
"onboarding.button.get_started.label" = "Rozpocznij";
"onboarding.button.get_started.hint" = "Dokończ wprowadzenie i zacznij używać Proxly";

"onboarding.page_indicator.label" = "Wskaźnik strony";
"onboarding.page_indicator.value" = "Strona %d z %d";
"onboarding.page_indicator.hint" = "Aktualna pozycja strony we wprowadzeniu";
"onboarding.page_indicators.label" = "Wskaźniki stron";
"onboarding.page_indicators.value" = "Strona %d z %d";

// Symbol Accessibility
"onboarding.symbol.light.label" = "Symbol aplikacji Proxly w trybie jasnym";
"onboarding.symbol.light.hint" = "Dekoracyjny symbol aplikacji wyświetlany w jasnym wyglądzie";
"onboarding.symbol.dark.label" = "Symbol aplikacji Proxly w trybie ciemnym";
"onboarding.symbol.dark.hint" = "Dekoracyjny symbol aplikacji wyświetlany w ciemnym wyglądzie";

// Welcome Page
"onboarding.welcome.title" = "Witamy w Proxly!";
"onboarding.welcome.subtitle" = "Przejmij kontrolę nad swoim doświadczeniem przeglądania sieci";
"onboarding.welcome.description" = "Proxly pomaga zarządzać tym, jak otwierają się linki, kierując je bez wysiłku do odpowiedniej przeglądarki na podstawie Twoich niestandardowych reguł.";
"onboarding.welcome.app_icon.label" = "Ikona aplikacji Proxly";
"onboarding.welcome.app_icon.hint" = "Oficjalna ikona aplikacji Proxly";

// What is Proxly Page
"onboarding.what_is.title" = "Co Może Zrobić dla Ciebie Proxly?";
"onboarding.what_is.subtitle" = "Inteligentne kierowanie przeglądarek uproszczone";
"onboarding.what_is.urls.title" = "Adresy URL";
"onboarding.what_is.browsers.title" = "Przeglądarki";
"onboarding.what_is.explanation" = "Proxly automatycznie otwiera linki w odpowiedniej przeglądarce lub aplikacji, a nawet może je blokować, wszystko na podstawie Twoich niestandardowych reguł. Koniec z ręcznym kopiowaniem i wklejaniem linków!";

// What is Proxly Demo Accessibility
"onboarding.what_is.urls.demo.label" = "Demonstracja przykładowych adresów URL";
"onboarding.what_is.urls.demo.hint" = "Pokazuje przykładowe adresy URL stron internetowych, które mogą być kierowane przez Proxly";
"onboarding.what_is.arrow.label" = "Strzałka wskazująca kierunek";
"onboarding.what_is.arrow.hint" = "Pokazuje przepływ od adresów URL do przeglądarek";
"onboarding.what_is.browsers.demo.label" = "Demonstracja przykładowych przeglądarek";
"onboarding.what_is.browsers.demo.hint" = "Pokazuje przykładowe przeglądarki, które mogą być używane jako cele kierowania";

// Demo Components Accessibility
"onboarding.url_demo.label" = "Przykładowy adres URL strony internetowej";
"onboarding.url_demo.hint" = "Demonstruje, jak różne strony internetowe mogą być kategoryzowane do kierowania";
"onboarding.browser_demo.label" = "Przykładowa opcja przeglądarki";
"onboarding.browser_demo.hint" = "Demonstruje opcje przeglądarek dostępne do kierowania";

// Rules Page
"onboarding.rules.title" = "Masz Kontrolę dzięki Regułom";
"onboarding.rules.subtitle" = "Reguły to serce Proxly";
"onboarding.rules.example.work.title" = "Domeny Pracy";
"onboarding.rules.example.work.description" = "Zawsze otwieraj linki z domena-pracy.com w Chrome";
"onboarding.rules.example.social.title" = "Media Społecznościowe";
"onboarding.rules.example.social.description" = "Otwieraj linki mediów społecznościowych w ulubionej przeglądarce";
"onboarding.rules.example.focus.title" = "Tryb Skupienia";
"onboarding.rules.example.focus.description" = "Blokuj rozpraszająca-strona.com gdy aktywny jest Tryb Skupienia Pracy";

// Rules Examples Accessibility
"onboarding.rules.example.work.accessibility.label" = "Przykład reguły domeny pracy";
"onboarding.rules.example.work.accessibility.hint" = "Demonstruje, jak kierować strony internetowe związane z pracą do określonych przeglądarek";
"onboarding.rules.example.social.accessibility.label" = "Przykład reguły mediów społecznościowych";
"onboarding.rules.example.social.accessibility.hint" = "Demonstruje, jak kierować strony mediów społecznościowych do preferowanych przeglądarek";
"onboarding.rules.example.focus.accessibility.label" = "Przykład reguły trybu skupienia";
"onboarding.rules.example.focus.accessibility.hint" = "Demonstruje, jak blokować rozpraszające strony internetowe podczas czasu skupienia";

// Menu Bar Page
"onboarding.menu_bar.title" = "Szybki Dostęp z Paska Menu";
"onboarding.menu_bar.subtitle" = "Miej oko na Proxly i łatwo nim zarządzaj";
"onboarding.menu_bar.proxly_icon.label" = "Ikona Proxly w pasku menu";
"onboarding.menu_bar.proxly_icon.hint" = "Ikona Proxly w pasku menu Twojego Mac-a";
"onboarding.menu_bar.feature.status.title" = "Zobacz, czy Proxly jest aktywne";
"onboarding.menu_bar.feature.status.description" = "Wizualny wskaźnik pokazuje, gdy reguły są włączone";
"onboarding.menu_bar.feature.toggle.title" = "Szybko włącz lub wyłącz Proxly";
"onboarding.menu_bar.feature.toggle.description" = "Przełącz wszystkie reguły jednym kliknięciem";
"onboarding.menu_bar.feature.settings.title" = "Otwórz ustawienia Proxly";
"onboarding.menu_bar.feature.settings.description" = "Dostęp do edytora reguł i konfiguracji";

// Menu Bar Accessibility
"onboarding.menu_bar.wifi.label" = "Ikona stanu Wi-Fi";
"onboarding.menu_bar.battery.label" = "Ikona stanu baterii";
"onboarding.menu_bar.mockup.label" = "Makieta paska menu";
"onboarding.menu_bar.mockup.hint" = "Demonstracja tego, jak Proxly pojawia się w pasku menu Twojego Mac-a";
"onboarding.menu_bar.features.label" = "Lista funkcji paska menu";
"onboarding.menu_bar.features.hint" = "Wymienia główne funkcje dostępne z paska menu";
"onboarding.menu_bar.feature.label" = "Funkcja paska menu";
"onboarding.menu_bar.feature.hint" = "Pojedyncza funkcja dostępna z paska menu Proxly";

// Focus Modes Page
"onboarding.focus_modes.title" = "Mądrzejsze Przeglądanie z Trybami Skupienia";
"onboarding.focus_modes.subtitle" = "Synchronizuj z Trybami Skupienia macOS";
"onboarding.focus_modes.work.description" = "Różne przeglądarki dla czasu pracy";
"onboarding.focus_modes.personal.description" = "Strony osobiste w czasie prywatnym";
"onboarding.focus_modes.dnd.description" = "Blokuj rozpraszające strony podczas Nie Przeszkadzać";
"onboarding.focus_modes.permission_note" = "Proxly poprosi o pozwolenie na dostęp do Trybów Skupienia, aby włączyć tę funkcję.";

// Focus Modes Examples Accessibility
"onboarding.focus_modes.work.accessibility.label" = "Przykład trybu skupienia pracy";
"onboarding.focus_modes.work.accessibility.hint" = "Demonstruje, jak Proxly może kierować przeglądarki różnie podczas czasu skupienia pracy";
"onboarding.focus_modes.personal.accessibility.label" = "Przykład osobistego trybu skupienia";
"onboarding.focus_modes.personal.accessibility.hint" = "Demonstruje, jak Proxly może kierować przeglądarki różnie podczas czasu osobistego";
"onboarding.focus_modes.dnd.accessibility.label" = "Przykład trybu skupienia Nie Przeszkadzać";
"onboarding.focus_modes.dnd.accessibility.hint" = "Demonstruje, jak Proxly może blokować rozpraszające strony internetowe podczas Nie Przeszkadzać";
"onboarding.focus_modes.permission_note.label" = "Nota pozwolenia trybów skupienia";
"onboarding.focus_modes.permission_note.hint" = "Informacje o wymaganiach pozwoleń dla integracji z Trybem Skupienia";

// Get Started Page
"onboarding.get_started.title" = "Gotowy na Utworzenie Pierwszej Reguły?";
"onboarding.get_started.subtitle" = "Najlepszym sposobem na poznanie Proxly jest skonfigurowanie pierwszej reguły";
"onboarding.get_started.step1.title" = "Ustaw jako Domyślną Przeglądarkę";
"onboarding.get_started.step1.description" = "Ustaw Proxly jako domyślną przeglądarkę w Ustawieniach Systemu";
"onboarding.get_started.step2.title" = "Utwórz Pierwszą Regułę";
"onboarding.get_started.step2.description" = "Dodaj regułę do kierowania określonych domen do preferowanej przeglądarki";
"onboarding.get_started.step3.title" = "Testuj i Ciesz się";
"onboarding.get_started.step3.description" = "Kliknij dowolny link i obserwuj, jak Proxly inteligentnie go kieruje tam, gdzie chcesz";
"onboarding.get_started.ready_message" = "Jesteś Gotowy!";
"onboarding.get_started.help_message" = "Eksploruj ustawienia Proxly, aby bardziej je dostosować. Zawsze możesz dodawać, zmieniać lub usuwać reguły, gdy zmieniają się Twoje potrzeby.";

// Get Started Accessibility
"onboarding.get_started.completion.label" = "Komunikat o zakończeniu konfiguracji";
"onboarding.get_started.completion.hint" = "Komunikat gratulacyjny wskazujący, że konfiguracja Proxly jest zakończona";
"onboarding.setup_step.button.label" = "Krok konfiguracji z akcją";
"onboarding.setup_step.button.hint" = "Interaktywny krok konfiguracji, który można nacisnąć, aby wykonać akcję";
"onboarding.setup_step.info.label" = "Informacja o kroku konfiguracji";
"onboarding.setup_step.info.hint" = "Informacyjny krok konfiguracji, który dostarcza instrukcje do zakończenia konfiguracji";
// MARK: - License Sheet
"about.license_sheet.title" = "Licencje Open Source";
"about.license_sheet.description" = "Ta aplikacja korzysta z następujących bibliotek oprogramowania open source:";
"about.license_sheet.button.done" = "Gotowe";
"about.license_sheet.swiftglass.name" = "SwiftGlass";
"about.license_sheet.swiftglass.version" = "Wersja: 1.9.9";
"about.license_sheet.swiftglass.source" = "Źródło: https://github.com/1998code/SwiftGlass/";

// MARK: - About Links
"about.link.licenses" = "Licencje Open Source";
"about.link.licenses_description" = "Wyświetl licencje oprogramowania open source";

// MARK: - License Sheet Accessibility
"accessibility.about.license_sheet.title.label" = "Licencje Open Source";
"accessibility.about.license_sheet.title.hint" = "Informacje o bibliotekach stron trzecich używanych w Proxly";
"accessibility.about.license_sheet.description.label" = "Nagłówek informacji o licencji";
"accessibility.about.license_sheet.description.hint" = "Wyjaśnia, jakie informacje są wyświetlane w tym widoku";
"accessibility.about.license_sheet.done_button.label" = "Gotowe";
"accessibility.about.license_sheet.done_button.hint" = "Zamyka arkusz informacji o licencji";
"accessibility.about.license_sheet.swiftglass.section.label" = "Licencja biblioteki SwiftGlass";
"accessibility.about.license_sheet.swiftglass.section.hint" = "Informacje o licencji dla biblioteki SwiftGlass";
"accessibility.about.license_sheet.scroll_view.label" = "Licencje Open Source";
"accessibility.about.license_sheet.scroll_view.hint" = "Przewijaj, aby zobaczyć informacje o licencji dla bibliotek stron trzecich";

// MARK: - About Links Accessibility
"accessibility.about.links.licenses_button.label" = "Licencje Open Source";
"accessibility.about.links.licenses_button.hint" = "Otwiera arkusz z informacjami o licencji oprogramowania open source";

// MARK: - Rule Management
"rule.remove" = "Usuń Regułę";
"rule.drop_browser" = "Odrzuć URL (Zablokuj)";
"rule.drop_browser.description" = "Zablokuj ten URL i zapobiegaj jego otwieraniu";
"rule.enable.title" = "Włącz Regułę";
"rule.enable.subtitle" = "Gdy włączona, ta reguła będzie aktywna i używana do kierowania URL-i";

// MARK: - Browser Profile Selector
"browser_profile_selector.profile" = "Profil";
"browser_profile_selector.custom_arguments" = "Argumenty Niestandardowe";
"browser_profile_selector.no_profile_support" = "Brak obsługi profili";
"browser_profile_selector.permission_needed" = "Wymagane pozwolenie";
"browser_profile_selector.permission_denied" = "Pozwolenie odrzucone";
"browser_profile_selector.permission_expired" = "Pozwolenie wygasło";
"browser_profile_selector.profiles_count" = "%d profili";
"browser_profile_selector.no_profiles_found" = "Nie znaleziono profili";
"browser_profile_selector.standard_browser" = "Standardowa przeglądarka";
"browser_profile_selector.tap_to_enable_profiles" = "Naciśnij, aby włączyć profile";
"browser_profile_selector.does_not_support_profiles" = "%@ nie obsługuje profili";

// MARK: - Profile Permission View
"profile_permission.title" = "Obsługa Profili Przeglądarki";
"profile_permission.subtitle" = "Otwieranie linków bezpośrednio w określonych profilach przeglądarki";
"profile_permission.what_enables" = "Co to umożliwia:";
"profile_permission.benefit.separate_browsing.title" = "Oddzielne przeglądanie służbowe i prywatne";
"profile_permission.benefit.separate_browsing.description" = "Utrzymuj swoje przeglądanie służbowe i prywatne całkowicie oddzielnie";
"profile_permission.benefit.different_extensions.title" = "Używanie różnych rozszerzeń na profil";
"profile_permission.benefit.different_extensions.description" = "Każdy profil może mieć swój własny zestaw rozszerzeń i ustawień";
"profile_permission.benefit.profile_configs.title" = "Konfiguracje specyficzne dla profilu";
"profile_permission.benefit.profile_configs.description" = "Różne motywy, zakładki i preferencje dla każdego profilu";
"profile_permission.permission_required" = "Wymagane pozwolenie:";
"profile_permission.requirement.read_access.title" = "Dostęp tylko do odczytu katalogów przeglądarki";
"profile_permission.requirement.read_access.description" = "Proxly musi odczytywać pliki konfiguracyjne, aby wykrywać twoje profile";
"profile_permission.requirement.no_data_access.title" = "Brak dostępu do danych osobistych";
"profile_permission.requirement.no_data_access.description" = "Odczytywane są tylko nazwy profili i podstawowe ustawienia - brak historii, haseł czy danych przeglądania";
"profile_permission.requirement.optional.title" = "Całkowicie opcjonalne";
"profile_permission.requirement.optional.description" = "Możesz używać Proxly bez funkcji profili - są całkowicie opcjonalne";
"profile_permission.browser_permissions" = "Pozwolenia przeglądarki:";
"profile_permission.learn_more" = "Dowiedz się Więcej o Dostępie do Danych";
"profile_permission.done" = "Gotowe";
"profile_permission.state.not_requested" = "Pozwolenie nie zostało żądane";
"profile_permission.state.denied" = "Pozwolenie odrzucone";
"profile_permission.state.granted" = "Pozwolenie przyznane";
"profile_permission.state.needs_refresh" = "Pozwolenie wymaga odświeżenia";
"profile_permission.button.requesting" = "Żądanie...";
"profile_permission.button.grant_access" = "Przyznaj Dostęp";
"profile_permission.button.retry" = "Spróbuj ponownie";
"profile_permission.button.revoke" = "Cofnij";

// MARK: - Data Access Explanation
"data_access.title" = "Wyjaśnienie Dostępu do Danych";
"data_access.what_accesses" = "Do czego Proxly ma dostęp:";
"data_access.access.config_files.title" = "Pliki konfiguracyjne profili";
"data_access.access.config_files.description" = "Pliki jak 'Local State' (Chrome/Edge) i 'profiles.ini' (Firefox), które zawierają nazwy profili i podstawowe ustawienia";
"data_access.access.directory_names.title" = "Nazwy katalogów profili";
"data_access.access.directory_names.description" = "Nazwy folderów profili do identyfikacji dostępnych profili";
"data_access.never_accesses" = "Do czego Proxly NIGDY nie ma dostępu:";
"data_access.never.browsing_history.title" = "Historia przeglądania";
"data_access.never.browsing_history.description" = "Twoja historia przeglądania nigdy nie jest odczytywana ani dostępna";
"data_access.never.passwords.title" = "Hasła i dane logowania";
"data_access.never.passwords.description" = "Nie ma dostępu do plików haseł ani informacji logowania";
"data_access.never.bookmarks.title" = "Zakładki i dane osobiste";
"data_access.never.bookmarks.description" = "Osobiste zakładki i dane przeglądania pozostają prywatne";
"data_access.never.cookies.title" = "Pliki cookie i dane sesji";
"data_access.never.cookies.description" = "Pliki cookie ani informacje sesji nie są odczytywane";
"data_access.technical_details" = "Szczegóły techniczne:";
"data_access.technical.security_bookmarks.title" = "Zakładki zabezpieczeń z zasięgiem";
"data_access.technical.security_bookmarks.description" = "Zakładki zabezpieczeń z zasięgiem macOS są używane do utrzymania dostępu tylko do katalogów, które wyraźnie zatwierdzisz";
"data_access.technical.read_only.title" = "Dostęp tylko do odczytu";
"data_access.technical.read_only.description" = "Proxly żąda tylko dostępu do odczytu - nie może modyfikować danych twojej przeglądarki";
"data_access.technical.revocable.title" = "Pozwolenia odwołalne";
"data_access.technical.revocable.description" = "Możesz odwołać dostęp w dowolnym momencie z ustawień Proxly";

// MARK: - Profile Selection View
"profile_selection.enable_support" = "Włącz Obsługę Profili";
"profile_selection.grant_permission" = "Przyznaj pozwolenie na dostęp do profili %@";
"profile_selection.grant_permission_button" = "Przyznaj Pozwolenie";
"profile_selection.permission_denied_title" = "Pozwolenie Odrzucone";
"profile_selection.permission_denied_description" = "Obsługa profili wymaga pozwolenia na dostęp do katalogów przeglądarki";
"profile_selection.retry_permission" = "Spróbuj Ponownie Pozwolenie";
"profile_selection.permission_expired_title" = "Pozwolenie Wygasło";
"profile_selection.permission_expired_description" = "Pozwolenie profilu musi zostać odświeżone";
"profile_selection.refresh_permission" = "Odśwież Pozwolenie";
"profile_selection.detecting_profiles" = "Wykrywanie profili...";
"profile_selection.no_profiles_found" = "Nie znaleziono profili";
"profile_selection.no_profiles_description" = "Nie wykryto profili %@. Możesz utworzyć profile w %@ a pojawią się tutaj.";
"profile_selection.select_profile" = "Wybierz profil:";
"profile_selection.any_profile" = "Dowolny Profil";
"profile_selection.use_default_profile" = "Użyj domyślnego profilu";
"profile_selection.default" = "Domyślny";
"profile_selection.used_time_ago" = "Użyto %@";
"profile_selection.active" = "Aktywny";
"profile_selection.inactive" = "Nieaktywny";

// MARK: - Custom Arguments View
"custom_arguments.title" = "Argumenty Niestandardowe";
"custom_arguments.placeholder" = "Dodaj argument (np. --incognito)";
"custom_arguments.add" = "Dodaj";
"custom_arguments.warning" = "Argumenty niestandardowe mogą wpłynąć na zachowanie przeglądarki. Używaj ostrożnie.";
"custom_arguments.help.title" = "Argumenty Niestandardowe Przeglądarki";
"custom_arguments.help.common_arguments" = "Popularne Argumenty";
"custom_arguments.help.incognito.argument" = "--incognito";
"custom_arguments.help.incognito.description" = "Uruchom w trybie prywatnym/incognito";
"custom_arguments.help.new_window.argument" = "--new-window";
"custom_arguments.help.new_window.description" = "Otwórz w nowym oknie";
"custom_arguments.help.disable_security.argument" = "--disable-web-security";
"custom_arguments.help.disable_security.description" = "Wyłącz bezpieczeństwo web (tylko rozwój)";
"custom_arguments.help.private_window.argument" = "--private-window";
"custom_arguments.help.private_window.description" = "Uruchom w trybie prywatnym";
"custom_arguments.help.new_tab.argument" = "--new-tab";
"custom_arguments.help.new_tab.description" = "Otwórz URL w nowej karcie";
"custom_arguments.help.important_notes" = "Ważne Uwagi";
"custom_arguments.help.note.behavior" = "Argumenty niestandardowe mogą wpłynąć na zachowanie i bezpieczeństwo przeglądarki";
"custom_arguments.help.note.browser_specific" = "Argumenty są specyficzne dla przeglądarki i mogą nie działać we wszystkich przeglądarkach";
"custom_arguments.help.note.trust" = "Używaj tylko argumentów, które rozumiesz i którym ufasz";
"custom_arguments.help.app_store_limitations" = "Ograniczenia App Store";
"custom_arguments.help.app_store_description" = "Ze względu na ograniczenia piaskownicy App Store, niektóre argumenty mogą nie działać zgodnie z oczekiwaniami. Przeglądarka wróci do domyślnego zachowania, jeśli argumenty nie są obsługiwane.";
"custom_arguments.help.done" = "Gotowe";
"custom_arguments.help.compatible" = "Kompatybilne: %@";

// MARK: - Settings Profile Features
"settings.profile_features.title" = "Funkcje Profili";
"settings.profile_features.enable.title" = "Włącz Funkcje Profili";
"settings.profile_features.enable.subtitle.enabled" = "Funkcje profili są włączone";
"settings.profile_features.enable.subtitle.disabled" = "Funkcje profili są wyłączone";
"settings.profile_features.manage_permissions.title" = "Zarządzaj Pozwoleniami Profili";
"settings.profile_features.manage_permissions.subtitle" = "Skonfiguruj, które przeglądarki mogą mieć dostęp do danych profili";
"settings.profile_features.manage_permissions.button" = "Zarządzaj Pozwoleniami";

// MARK: - Browser Profile Accessibility
"accessibility.browser_profile_selector.profile.label" = "Wybór profilu";
"accessibility.browser_profile_selector.profile.hint" = "Wybierz profil przeglądarki dla tej reguły";
"accessibility.browser_profile_selector.custom_arguments.label" = "Argumenty niestandardowe";
"accessibility.browser_profile_selector.custom_arguments.hint" = "Dodaj niestandardowe argumenty linii poleceń dla przeglądarki";
"accessibility.browser_profile_selector.refresh_profiles.label" = "Odśwież profile";
"accessibility.browser_profile_selector.refresh_profiles.hint" = "Odśwież listę dostępnych profili";

// MARK: - Profile Permission Accessibility
"accessibility.profile_permission.title.label" = "Obsługa Profili Przeglądarki";
"accessibility.profile_permission.title.hint" = "Informacje o funkcjach i pozwoleniach profili przeglądarki";
"accessibility.profile_permission.benefit.label" = "Korzyść funkcji profilu";
"accessibility.profile_permission.benefit.hint" = "Wyjaśnia, jak funkcje profilu mogą pomóc w organizacji przeglądania";
"accessibility.profile_permission.requirement.label" = "Wymaganie pozwolenia";
"accessibility.profile_permission.requirement.hint" = "Informacje o tym, jakie pozwolenia są potrzebne i dlaczego";
"accessibility.profile_permission.browser_row.label" = "Pozwolenie przeglądarki dla %@";
"accessibility.profile_permission.browser_row.hint" = "Zarządzaj pozwoleniami dostępu profilu dla tej przeglądarki";
"accessibility.profile_permission.learn_more.label" = "Dowiedz się więcej o dostępie do danych";
"accessibility.profile_permission.learn_more.hint" = "Otwiera szczegółowe wyjaśnienie, do jakich danych Proxly ma dostęp";

// MARK: - Profile Selection Accessibility
"accessibility.profile_selection.enable_support.label" = "Włącz obsługę profili";
"accessibility.profile_selection.enable_support.hint" = "Przyznaj pozwolenie na dostęp do profili przeglądarki";
"accessibility.profile_selection.permission_request.label" = "Żądanie pozwolenia profilu";
"accessibility.profile_selection.permission_request.hint" = "Informacje o pozwoleniach profilu z akcją przyznania dostępu";
"accessibility.profile_selection.profile_card.label" = "Profil %@";
"accessibility.profile_selection.profile_card.hint" = "Wybierz ten profil dla reguły";
"accessibility.profile_selection.any_profile.label" = "Opcja dowolny profil";
"accessibility.profile_selection.any_profile.hint" = "Użyj domyślnego profilu bez określania konkretnego";

// MARK: - Custom Arguments Accessibility
"accessibility.custom_arguments.title.label" = "Argumenty niestandardowe";
"accessibility.custom_arguments.title.hint" = "Dodaj niestandardowe argumenty linii poleceń dla przeglądarki";
"accessibility.custom_arguments.help.label" = "Pomoc argumentów niestandardowych";
"accessibility.custom_arguments.help.hint" = "Otwiera informacje pomocy o argumentach linii poleceń przeglądarki";
"accessibility.custom_arguments.argument.label" = "Argument %@";
"accessibility.custom_arguments.argument.hint" = "Naciśnij, aby usunąć ten argument";
"accessibility.custom_arguments.add_field.label" = "Dodaj nowy argument";
"accessibility.custom_arguments.add_field.hint" = "Wprowadź niestandardowy argument przeglądarki do dodania";
"accessibility.custom_arguments.add_button.label" = "Dodaj argument";
"accessibility.custom_arguments.add_button.hint" = "Dodaj wprowadzony argument do listy";

// MARK: - Settings Profile Features Accessibility
"accessibility.settings.profile_features.section.label" = "Sekcja Funkcji Profili";
"accessibility.settings.profile_features.section.hint" = "Opcje konfiguracji dla funkcji profili przeglądarki";
"accessibility.settings.profile_features.enable.label" = "Włącz funkcje profili";
"accessibility.settings.profile_features.enable.hint" = "Gdy włączone, pozwala otwierać linki w określonych profilach przeglądarki";
"accessibility.settings.profile_features.enable.value.enabled" = "Funkcje profili są włączone";
"accessibility.settings.profile_features.enable.value.disabled" = "Funkcje profili są wyłączone";
"accessibility.settings.profile_features.manage_permissions.label" = "Zarządzaj pozwoleniami profili";
"accessibility.settings.profile_features.manage_permissions.hint" = "Otwiera interfejs zarządzania pozwoleniami profili";

/* Missing Menu Bar Manager Accessibility */
"accessibility.menu_bar_manager.status_item.button_label" = "Menu Proxly";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Reguły Proxly są włączone. Kliknij, aby otworzyć menu.";
"accessibility.menu_bar_manager.actions.open_settings" = "Otwórz Ustawienia";

/* Missing Settings Accessibility */
"accessibility.settings.show_tooltips.label" = "Przełącz Pokazywanie Podpowiedzi";
"accessibility.settings.show_tooltips.hint" = "Przełącz, aby pokazać lub ukryć pomocne podpowiedzi w całej aplikacji";
"accessibility.settings.show_tooltips.value.enabled" = "Podpowiedzi są włączone";
"accessibility.settings.show_tooltips.value.disabled" = "Podpowiedzi są wyłączone";

/* Missing Profile Features Settings */
"settings.section.profile_features" = "Funkcje Profili";
"accessibility.settings.profile_features.section_label" = "Sekcja Funkcji Profili";
"settings.profile_features.enable" = "Włącz Funkcje Profili";
"settings.profile_features.subtitle.enabled" = "Funkcje profili są włączone";
"settings.profile_features.subtitle.disabled" = "Funkcje profili są wyłączone";
"settings.profile_features.manage_permissions" = "Zarządzaj Pozwoleniami Profili";
"settings.profile_features.manage_permissions.subtitle" = "Skonfiguruj, które przeglądarki mogą uzyskać dostęp do danych profilu";
"settings.profile_features.manage_permissions.button" = "Zarządzaj Pozwoleniami";

// MARK: - License Prompt View

// MARK: - License Management
"license.status.valid" = "Licencja ważna";
"license.status.invalid" = "Nieważna: %@";
"license.status.not_verified" = "Licencja niezweryfikowana";
"license.status.verifying" = "Weryfikowanie licencji...";

"license.error.empty" = "Klucz licencyjny nie może być pusty";
"license.error.storage" = "Nie udało się zapisać klucza licencyjnego";
"license.error.invalid_key" = "Nieprawidłowy klucz licencyjny";
"license.error.network" = "Błąd sieci podczas weryfikacji";
"license.error.unknown" = "Wystąpił nieznany błąd";
"license.error.invalid_url" = "Nieprawidłowy adres URL weryfikacji";
"license.error.invalid_response" = "Nieprawidłowa odpowiedź serwera";
"license.error.http_error" = "Błąd HTTP: %d";
"license.error.invalid_json" = "Nieprawidłowy format odpowiedzi";

"license.prompt.title" = "Wprowadź Klucz Licencyjny";
"license.prompt.subtitle" = "Proszę wprowadzić klucz licencyjny Proxly, aby kontynuować";
"license.prompt.placeholder" = "Wprowadź klucz licencyjny";
"license.prompt.verify_button" = "Weryfikuj Licencję";
"license.prompt.quit_button" = "Zakończ";
"license.prompt.retry_button" = "Ponów";

"license.onboarding.title" = "Witamy w Proxly";
"license.onboarding.subtitle" = "Weryfikacja Licencji";
"license.onboarding.description" = "Aby korzystać z Proxly, proszę wprowadzić klucz licencyjny. Jeśli jeszcze go nie masz, możesz kupić go na naszej stronie internetowej.";

"license.prompt.input.label" = "Klucz Licencyjny";
"license.prompt.input.placeholder" = "Wprowadź klucz licencyjny";
"license.prompt.button.verify" = "Weryfikuj Licencję";
"license.prompt.button.purchase" = "Kup Licencję";
"license.prompt.app_store.notice" = "To jest wersja App Store. Weryfikacja licencji nie jest wymagana.";

"license.prompt.input.accessibility.label" = "Pole wprowadzania klucza licencyjnego";
"license.prompt.input.accessibility.hint" = "Wprowadź tutaj swój klucz licencyjny Proxly";
"license.prompt.status.accessibility.label" = "Status weryfikacji licencji";
"license.prompt.button.verify.accessibility.label" = "Przycisk weryfikacji licencji";
"license.prompt.button.verify.accessibility.hint" = "Dotknij, aby zweryfikować wprowadzony klucz licencyjny";
"license.prompt.button.purchase.accessibility.label" = "Przycisk zakupu licencji";
"license.prompt.button.purchase.accessibility.hint" = "Dotknij, aby otworzyć stronę zakupu Proxly";
"license.prompt.app_store.accessibility.label" = "Informacja o wersji App Store";

// MARK: - Onboarding License Page
"onboarding.license.title" = "Witamy w Proxly";
"onboarding.license.subtitle" = "Aby rozpocząć, proszę zweryfikować klucz licencyjny lub kupić Proxly.";
"onboarding.license.input.label" = "Klucz Licencyjny";
"onboarding.license.input.placeholder" = "Wprowadź klucz licencyjny";
"onboarding.license.button.verify" = "Weryfikuj Licencję";
"onboarding.license.button.purchase" = "Kup Licencję";
"onboarding.license.app_store.notice" = "Używasz wersji App Store. Weryfikacja licencji nie jest wymagana.";
"onboarding.license.help.message" = "Potrzebujesz pomocy? Skontaktuj się z pomocą techniczną lub sprawdź e-mail z zakupem, aby znaleźć klucz licencyjny.";

"onboarding.license.input.accessibility.label" = "Pole wprowadzania klucza licencyjnego";
"onboarding.license.input.accessibility.hint" = "Wprowadź klucz licencyjny Proxly, aby kontynuować";
"onboarding.license.status.accessibility.label" = "Status weryfikacji licencji";
"onboarding.license.button.verify.accessibility.label" = "Przycisk weryfikacji licencji";
"onboarding.license.button.verify.accessibility.hint" = "Zweryfikuj wprowadzony klucz licencyjny";
"onboarding.license.button.purchase.accessibility.label" = "Przycisk zakupu licencji";
"onboarding.license.button.purchase.accessibility.hint" = "Otwórz stronę zakupu Proxly";
"onboarding.license.app_store.accessibility.label" = "Informacja o wersji App Store";
"onboarding.license.help.accessibility.label" = "Informacje pomocy dotyczące licencji";

"onboarding.page.license.label" = "Strona weryfikacji licencji";
"onboarding.page.license.hint" = "Wprowadź i zweryfikuj klucz licencyjny Proxly";

"Licensed copy" = "Licencjonowana kopia";